Tests/Tools/fake_probe_ipv4.sh

printf "<soap:Envelope xmlns:soap=\"http://www.w3.org/2003/05/soap-envelope\" xmlns:wsa=\"http://www.w3.org/2005/08/addressing\" xmlns:wsd=\"http://docs.oasis-open.org/ws-dd/ns/discovery/2009/01\" xmlns:dpws=\"http://docs.oasis-open.org/ws-dd/ns/dpws/2009/01\" xmlns:i6=\"http://message-model-uri/15/04\"><soap:Header><wsa:MessageID>1c427d9d-d134-4c4f-90fa-7e196911fce7</wsa:MessageID><wsa:To>urn:docs-oasis-open-org:ws-dd:ns:discovery:2009:01</wsa:To><wsa:Action>http://docs.oasis-open.org/ws-dd/ns/discovery/2009/01/Probe</wsa:Action><wsd:AppSequence InstanceId=\"424238335\" MessageNumber=\"1\"/></soap:Header><soap:Body><wsd:Probe><wsd:Types>dpws:Device i6:MedicalDevice</wsd:Types><wsd:Scopes/></wsd:Probe></soap:Body></soap:Envelope>" | nc -un -i 1 -w 1 239.255.255.250 3702
